load-test/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="info" dumptraffic="true">
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="127.0.0.1" port="4567" type="tcp"></server>
  </servers>

  <!--
  <monitoring>
    <monitor name="" type="erlang"></monitor>
  </monitoring>
  -->

  <load>
    <user session="queue_creator" start_time="0" unit="minute"></user>
    <arrivalphase phase="1" duration="5" unit="second">
      <!-- Don't do much, to give queue_creator a chance to run -->
      <users interarrival="1" unit="minute"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="minute">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>
  </load>

  <!--
      Suppose I should define what I hope to do with this?

      Ideally, set up a number of queues (each with max retries and a DLQ?).
      Maybe just one queue to start off with.
      Then I need to create some consumers and some producers.

      Consumers: Initially lets just have these blindly read & delete.
      Producers: Should just blindly post some messages.
      -->

  <sessions>
    <session name="queue_creator" weight="0" type="ts_http">
      <request><http url='http://localhost:4567/' version='1.1'  contents='QueueName=tsung_queue1&amp;Version=2012-11-05&amp;Action=CreateQueue' content_type='application/x-www-form-urlencoded' method='POST'></http></request>
    </session>
    <session name="producer" weight="1" type="ts_http">
      <for from="1" to="10000" incr="1" var="counter">
        <request><http url='/' version='1.1'  contents='Action=SendMessage&amp;MessageBody=oTA%3D&amp;Version=2012-11-05&amp;QueueUrl=http%3A%2F%2Flocalhost%3A4567%2Ftsung_queue1' content_type='application/x-www-form-urlencoded' method='POST'></http></request>
        <thinktime value="3" random="true" />
      </for>
    </session>

    <session name="consumer" weight="1" type="ts_http">
      <request>
        <!-- No idea why this xpath is not working, but for now I'll just use regexp -->
        <!-- <dyn_variable name="message_receipts" xpath="/ReceiveMessageResponse/ReceiveMessageResult/Message/MessageId" /> -->
        <dyn_variable name="message_receipts" re="ReceiptHandle.(.*).\/ReceiptHandle" />
        <http url='/' version='1.1'  contents='Action=ReceiveMessage&amp;WaitTimeSeconds=0&amp;AttributeName.1=SentTimestamp&amp;Version=2012-11-05&amp;QueueUrl=http%3A%2F%2Flocalhost%3A4567%2Ftsung_queue1&amp;MaxNumberOfMessages=1&amp;AttributeName.2=ApproximateReceiveCount&amp;VisibilityTimeout=30' content_type='application/x-www-form-urlencoded' method='POST'></http>
      </request>
      <if var="message_receipts" neq="">
        <foreach name="receipt" in="message_receipts">
            <!-- <thinktime value="5" random="true"/> -->
            <request subst="true">
            <http url='/' version='1.1'  contents='Version=2012-11-05&amp;QueueUrl=http%3A%2F%2Flocalhost%3A4567%2Ftsung_queue1&amp;ReceiptHandle=%%_receipt%%&amp;Action=DeleteMessage' content_type='application/x-www-form-urlencoded' method='POST'></http>
            </request>
        </foreach>
      </if>
    </session>
  </sessions>

</tsung>